dewayne57/PIC18F__Q43/07 ADCC DAC/ADCC 02 Oversampling/main.c
/* *****************************************************************************************
 *   File Name: main.c
 *   Description: ADCC oversampling with hardware averaging and UART reporting.
 *   Author: Dewayne Hafenstein
 *   Date: 2026-06-10
 *
 *   Copyright (c) 2026, Dewayne Hafenstein.
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 ***************************************************************************************** */

#include <xc.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include "config.h"
#include "../../Libraries/UARTLIB/uartlib.h"

static volatile uint16_t adcAveragedCounts;
static volatile bool reportAveragedSample;

static char console_tx_buffer[256];
static char console_rx_buffer[128];

static uart_handle_t console_uart = {
    .port = UART_PORT_1,
    .high_speed_baud = false,
    .baud_rate = 19200U,
    .fosc = _XTAL_FREQ,
    .data_bits = 8U,
    .parity = UART_PARITY_NONE,
    .stop_bits = UART_STOP_BITS_1,
    .flow_control = UART_FLOW_NONE,
    .tx_buffer = console_tx_buffer,
    .tx_buffer_size = sizeof(console_tx_buffer),
    .rx_buffer = console_rx_buffer,
    .rx_buffer_size = sizeof(console_rx_buffer),
    .tx_head = 0U,
    .tx_tail = 0U,
    .rx_head = 0U,
    .rx_tail = 0U,
    .initialized = false,
    .tx_pin = UART_PPS_PIN_RB0,
    .rx_pin = UART_PPS_PIN_RB1,
    .rts_pin = UART_PPS_PIN_NONE,
    .cts_pin = UART_PPS_PIN_NONE,
    .isr_mode = UART_ISR_VECTORED,
};

#if defined(VECTORED_INTERRUPTS_ENABLED)
void __interrupt(irq(IRQ_U1RX), low_priority) UART1_RX_ISR(void)
{
    UART_HandleRxInterrupt(&console_uart);
}

void __interrupt(irq(IRQ_U1TX), low_priority) UART1_TX_ISR(void)
{
    UART_HandleTxInterrupt(&console_uart);
}

// @brief ADC interrupt service routine.  Fires once per ADCC_OVERSAMPLE_COUNT
/// conversions when the hardware Average mode result is transferred into ADRES.
/// The ISR copies the hardware-averaged 12-bit value for UART reporting.
void __interrupt(irq(IRQ_AD), high_priority) ADC_ISR(void)
{
    if (PIR1bits.ADIF)
    {
        adcAveragedCounts = ADRES;
        PIR1bits.ADIF = 0;
        reportAveragedSample = true;
    }
}
#else
/// @brief Legacy (flat) interrupt service routine.  Handles all interrupts, including UART and ADC.
/// The ADC interrupt fires once per ADCC_OVERSAMPLE_COUNT conversions when the hardware Average mode
/// result is transferred into ADRES. The ISR copies the hardware-averaged 12-bit value for UART reporting.
/// @param  None
/// @return  None
void __interrupt() NonVectoredISR(void)
{
    if (PIR4bits.U1RXIF)
    {
        UART_HandleRxInterrupt(&console_uart);
    }

    if (PIR4bits.U1TXIF)
    {
        UART_HandleTxInterrupt(&console_uart);
    }

    if (PIR1bits.ADIF)
    {
        adcAveragedCounts = ADRES;
        PIR1bits.ADIF = 0;
        reportAveragedSample = true;
    }
}
#endif

/// @brief Main application entry point.
/// Initializes the ADCC for hardware oversampling and averaging, sets up the UART for console 
/// reporting, and then enters a loop where it triggers ADCC conversions at a regular interval 
/// and reports the averaged results over UART when they are ready.
/// @Note This code uses the ADCC hardware averaging feature, which means the ADC interrupt 
/// fires only once per ADCC_OVERSAMPLE_COUNT conversions, when the average result is transferred
/// into ADRES.  This means that the main loop is free to perform other tasks or enter a 
/// low-power state between samples if desired, since it does not need to service an interrupt 
/// for every single conversion.  In this demonstration, the main loop simply waits for the 
/// averaged sample to be ready and then prints it over UART, while also managing the timing 
/// of the ADCC triggers with a simple software timer.
/// @param  None
/// @return  None
void main(void)
{
    uint16_t triggerCountdownMs;

    adcAveragedCounts = 0;
    reportAveragedSample = false;
    triggerCountdownMs = 0; // Trigger immediately at startup, then every ADCC_TRIGGER_PERIOD_MS

    SYSTEM_Initialize();
    if (!UART_Open(&console_uart))
    {
        while (1)
        {
        }
    }
    UART_SelectPrintfTarget(&console_uart);

    printf("ADCC 02 Oversampling Filtering%s", CRLF);
    printf("HW avg samples=%u (CRS=%u), SW trigger=%u ms%s",
           ADCC_OVERSAMPLE_COUNT,
           ADCC_OVERSAMPLE_CRS,
           ADCC_TRIGGER_PERIOD_MS,
           CRLF);

    // Main loop: wait for averaged sample to be ready, print it, and trigger the next
    // burst when the timer expires.
    while (1)
    {
        if (reportAveragedSample)
        {
            reportAveragedSample = false;
            uint16_t sampleCounts;
            uint32_t sampleMv;

            INTCON0bits.GIEH = 0;
            sampleCounts = adcAveragedCounts;
            INTCON0bits.GIEH = 1;

            sampleMv = ADCC_COUNTS_TO_MV(sampleCounts);
            printf("Averaged Input: %4u counts (%4lu mV)%s", sampleCounts, sampleMv, CRLF);
        }

        // Start one new ADCC hardware-average burst whenever the trigger countdown
        // reaches zero and the ADC is idle.
        if ((triggerCountdownMs == 0U) && (ADCON0bits.GO == 0))
        {
            PIR1bits.ADIF = 0;
            ADCON0bits.GO = 1;

            triggerCountdownMs = ADCC_TRIGGER_PERIOD_MS; // Reset the trigger countdown for the next cycle
        }

        // Simple software timer for managing the trigger cadence.  The main loop is not doing 
        // anything else, so a blocking delay is sufficient.
        while (triggerCountdownMs > 0)
        {
            __delay_ms(1);
            triggerCountdownMs--;
        }
    }
}
